{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "unroll": false, "units": 64, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "tanh", "activity_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "dtype": "float32", "unit_forget_bias": true, "stateful": false, "name": "lstm_1", "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "implementation": 1, "return_sequences": false, "batch_input_shape": [null, 20, 129], "return_state": false}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_1", "units": 129, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}