{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "recurrent_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "trainable": true, "batch_input_shape": [null, 20, 129], "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "kernel_regularizer": null, "name": "lstm_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "units": 64, "activity_regularizer": null, "use_bias": true, "go_backwards": false, "return_state": false}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 129, "activity_regularizer": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}