{"backend": "tensorflow", "keras_version": "2.0.3", "config": [{"class_name": "LSTM", "config": {"units": 64, "trainable": true, "unit_forget_bias": true, "recurrent_regularizer": null, "go_backwards": false, "use_bias": true, "dtype": "float32", "name": "lstm_1", "kernel_constraint": null, "unroll": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "stateful": false, "batch_input_shape": [null, 20, 129], "return_sequences": false, "activity_regularizer": null, "dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"units": 129, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "class_name": "Sequential"}