{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": false, "unroll": false, "name": "lstm_1", "trainable": true, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 20, 129], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "return_state": false, "recurrent_constraint": null, "implementation": 1, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "bias_constraint": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "units": 64}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "units": 129}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}}