{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"implementation": 1, "kernel_constraint": null, "go_backwards": false, "trainable": true, "name": "lstm_1", "return_state": false, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "unroll": false, "recurrent_regularizer": null, "return_sequences": false, "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "batch_input_shape": [null, 20, 129], "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "rate": 0.2, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "linear", "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 129, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}]}, "backend": "tensorflow", "class_name": "Sequential"}