{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"implementation": 1, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 20, 129], "kernel_constraint": null, "units": 64, "bias_constraint": null, "return_sequences": false, "recurrent_dropout": 0.0, "name": "lstm_1", "trainable": true, "go_backwards": false, "return_state": false, "dropout": 0.0, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "unroll": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "activation": "tanh", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 129, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_1", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Sequential"}