{"config": [{"config": {"recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "activation": "tanh", "use_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "stateful": false, "units": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "implementation": 0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "go_backwards": false, "batch_input_shape": [null, 20, 129], "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0, "unroll": false, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "units": 129, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3"}