{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "unit_forget_bias": true, "implementation": 0, "kernel_regularizer": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, 20, 129], "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "dropout": 0.0, "units": 64, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "dtype": "float32", "bias_regularizer": null, "recurrent_regularizer": null, "unroll": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 129, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.0.3"}