{"keras_version": "2.0.3", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "go_backwards": false, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "stateful": false, "bias_regularizer": null, "use_bias": true, "dropout": 0.0, "name": "lstm_1", "bias_constraint": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 20, 129], "recurrent_regularizer": null, "trainable": true, "activity_regularizer": null, "implementation": 0, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "return_sequences": false}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "units": 129, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "class_name": "Sequential"}